Revit 2026 API

# SpeckleSpeckleColor1 Property

---

The property labeled "Color 1" from the "Speckle" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SpeckleColor1 { get; }
```
```vb
Public Shared ReadOnly Property SpeckleColor1 As String
	Get
```
```cpp
public:
static property String^ SpeckleColor1 {
	String^ get ();
}
```
```fsharp
static member SpeckleColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Speckle Class

Autodesk.Revit.DB.Visual Namespace